
    # Андронов Александр

# Задача1: Поработайте с переменными, создайте несколько, выведите на экран. Запросите у
# пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран

q = input("Enter your year, month and day: ")
k = int(input("Enter your number: "))
g = float(input("Enter any number again: "))

print(q, k, g)